---
kind: method
id: M:Autodesk.Revit.DB.TransactWithCentralOptions.GetLockCallback
source: html/07798372-8670-5cc0-f8eb-3df6a64d9c75.htm
---
# Autodesk.Revit.DB.TransactWithCentralOptions.GetLockCallback Method

Gets the callback object that changes Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model.

## Syntax (C#)
```csharp
public ICentralLockedCallback GetLockCallback()
```